ISWFoam/tutorial/FlatBottom-eKdV/constant/transportProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

nu              1e-06;

rhoRef    rhoRef [ 1 -3 0 0 0 0 0 ] 996;

CoriolisVector CoriolisVector [0 0 -1 0 0 0 0] (0 0 7.3e-05);
// ************************************************************************* //
